---
kind: method
id: M:Autodesk.Revit.DB.PaperSourceSet.Clear
source: html/e0a90bbb-9ea2-9cd7-01ab-02896e35fdaa.htm
---
# Autodesk.Revit.DB.PaperSourceSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```